app/Controllers/Attendance.php

        $taps = $tapBuilder->limit((int)$perPage, (int)$offset)->findAll();

        $residentIds = array_column($taps, 'resident_id');
        $allResidents = empty($residentIds) ? [] : $this->residentModel->whereIn('id', $residentIds)->findAll();
---
SELECT *
FROM `residents`
WHERE `id` IN ('8590')


        $totalResidents = $residentQuery->countAllResults(false);
        $offset = ($currentPage - 1) * $perPage;
        $allResidents = $residentQuery->orderBy('residents.last_name', 'ASC')
            ->limit((int)$perPage, (int)$offset)
            ->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `residents`
SELECT `residents`.*
FROM `residents`
ORDER BY `residents`.`last_name` ASC
 LIMIT 50


    $beneficiaries = [];
    foreach ($allResidents as $resident) {
        $attendanceQuery = $this->attendanceModel
            ->where('resident_id', $resident['id'])
            ->where('family_member_id', null)
            ->where('attendance_date', $date);
---
SELECT *
FROM `attendance`
WHERE `resident_id` = '8590'
AND `family_member_id` IS NULL
AND `attendance_date` = '2026-08-01'
 LIMIT 1

        $missingFamilyMembers = [];

        foreach ($familyMembers as &$member) {
            $memberQuery = $this->attendanceModel
                ->where('family_member_id', $member['id'])
                ->where('attendance_date', $date);
---
SELECT *
FROM `attendance`
WHERE `family_member_id` = '23755'
AND `attendance_date` = '2026-08-01'
 LIMIT 1

    $data['search'] = $search;
    $data['selectedEvent'] = $eventId;                                   // NEW
    $data['viewMode'] = $viewMode;                                       // NEW
    $data['events'] = $this->eventModel->orderBy('event_name', 'ASC')->findAll(); // NEW
---
SELECT *
FROM `events`
ORDER BY `event_name` ASC

    $data['perPage'] = $perPage;

    if ($userRole == 'admin') {
        $barangays = $this->residentModel->select('barangay')
                                         ->distinct()
                                         ->where('barangay !=', '')
                                         ->findAll();
---
SELECT DISTINCT `barangay`
FROM `residents`
WHERE `barangay` != ''

    public function stats()
    {
        $today = date('Y-m-d');
        $weekAgo = date('Y-m-d', strtotime('-7 days'));

        $stats = [
            'today' => $this->attendanceModel->getTodayCount(),
            'week' => $this->attendanceModel->where('attendance_date >=', $weekAgo)->countAllResults(),
            'month' => $this->attendanceModel->where('attendance_date >=', date('Y-m-01'))->countAllResults(),
            'active_now' => $this->attendanceModel->where('attendance_date', $today)
                                                  ->where('check_out_time IS NULL')
                                                  ->countAllResults()
---
SELECT COUNT(*) AS `numrows`
FROM `attendance`
WHERE `attendance_date` >= '2026-07-25'
SELECT COUNT(*) AS `numrows`
FROM `attendance`
WHERE `attendance_date` >= '2026-08-01'
SELECT COUNT(*) AS `numrows`
FROM `attendance`
WHERE `attendance_date` = '2026-08-01'
AND `check_out_time` IS NULL