app/Controllers/Event.php

public function index()
{
    $data['events'] = $this->eventModel->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `events`
ORDER BY `created_at` DESC