app/Models/AttendanceModel.php

public function getTodayCount($barangay = null)
{
    $today = date('Y-m-d');
    $builder = $this->where('attendance_date', $today);

    if ($barangay) {
        $builder->join('residents', 'residents.id = attendance.resident_id')
                ->where('residents.barangay', $barangay);
    }

    return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `attendance`
WHERE `attendance_date` = '2026-08-01'