app/Models/EventModel.php

public function getActiveEvents()
{
    return $this->where('is_active', 1)
                ->where('status', 'active')
                ->orderBy('event_name', 'ASC')
                ->findAll();
---
SELECT *
FROM `events`
WHERE `is_active` = 1
AND `status` = 'active'
ORDER BY `event_name` ASC