app/Models/FamilyMemberModel.php

SELECT *
FROM `family_members`
WHERE `resident_id` = '8590'
ORDER BY `created_at` ASC
---
    public function getByResidentId($residentId)
    {
        return $this->where('resident_id', $residentId)
                    ->orderBy('created_at', 'ASC')
                    ->findAll();