app/Models/InventoryModel.php

SELECT *
FROM `inventory`
WHERE `inventory_type` = 'cooked_food'
ORDER BY `id` DESC
 LIMIT 1
---
public function getActiveCookedFood()
{
    return $this->where('inventory_type', 'cooked_food')
                ->orderBy('id', 'DESC')
                ->first();