app/Models/KitchenDistributionModel.php

    public function getRecentByEvent($eventId = null, $limit = 100, $date = null)
    {
        $date = $date ?: date('Y-m-d');

        $builder = $this->db->table('kitchen_distributions kd');
        $builder->select('kd.*,
                         r.first_name as head_first_name,
                         r.last_name as head_last_name,
                         r.household_no,
                         r.barangay,
                         r.photo as head_photo,
                         fm.name as family_member_name,
                         fm.relation,
                         fm.photo as member_photo,
                         u.username as distributor_name')
->join('residents r', 'r.id = kd.resident_id', 'left')   // was inner join
                ->join('family_members fm', 'fm.id = kd.family_member_id', 'left')
                ->join('users u', 'u.id = kd.distributor_id', 'left')
->where('DATE(kd.distribution_date)', $date)
                ->where('kd.status', 'completed') // NEW: keep the main list free of denial logs
                ->orderBy('kd.distribution_date', 'DESC')
                ->limit($limit);

        if ($eventId) {
            $builder->where('kd.event_id', $eventId);
        }

        return $builder->get()->getResultArray();
---
SELECT `kd`.*, `r`.`first_name` as `head_first_name`, `r`.`last_name` as `head_last_name`, `r`.`household_no`, `r`.`barangay`, `r`.`photo` as `head_photo`, `fm`.`name` as `family_member_name`, `fm`.`relation`, `fm`.`photo` as `member_photo`, `u`.`username` as `distributor_name`
FROM `kitchen_distributions` `kd`
LEFT JOIN `residents` `r` ON `r`.`id` = `kd`.`resident_id`
LEFT JOIN `family_members` `fm` ON `fm`.`id` = `kd`.`family_member_id`
LEFT JOIN `users` `u` ON `u`.`id` = `kd`.`distributor_id`
WHERE DATE(kd.distribution_date) = '2026-08-01'
AND `kd`.`status` = 'completed'
ORDER BY `kd`.`distribution_date` DESC
 LIMIT 100

    public function getRecentActivity($eventId = null, $limit = 20, $date = null)
    {
        $date = $date ?: date('Y-m-d');

        $builder = $this->db->table('kitchen_distributions kd');
        $builder->select('kd.*,
                         r.first_name as head_first_name,
                         r.last_name as head_last_name,
                         r.household_no,
                         r.barangay,
                         r.photo as head_photo,
                         fm.name as family_member_name,
                         fm.relation,
                         fm.photo as member_photo')
                ->join('residents r', 'r.id = kd.resident_id', 'left')
                ->join('family_members fm', 'fm.id = kd.family_member_id', 'left')
                ->where('DATE(kd.distribution_date)', $date)
                ->orderBy('kd.distribution_date', 'DESC')
                ->limit($limit);

        if ($eventId) {
            $builder->where('kd.event_id', $eventId);
        }

        return $builder->get()->getResultArray();
---
SELECT `kd`.*, `r`.`first_name` as `head_first_name`, `r`.`last_name` as `head_last_name`, `r`.`household_no`, `r`.`barangay`, `r`.`photo` as `head_photo`, `fm`.`name` as `family_member_name`, `fm`.`relation`, `fm`.`photo` as `member_photo`
FROM `kitchen_distributions` `kd`
LEFT JOIN `residents` `r` ON `r`.`id` = `kd`.`resident_id`
LEFT JOIN `family_members` `fm` ON `fm`.`id` = `kd`.`family_member_id`
WHERE DATE(kd.distribution_date) = '2026-08-01'
ORDER BY `kd`.`distribution_date` DESC
 LIMIT 20

    public function getTodayCount($eventId = null, $date = null)
    {
        $date = $date ?: date('Y-m-d');
        $builder = $this->where('DATE(distribution_date)', $date)
                         ->where('status', 'completed'); // NEW: exclude denied duplicate-attempt logs
        if ($eventId) {
            $builder->where('event_id', $eventId);
        }
        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `kitchen_distributions`
WHERE DATE(distribution_date) = '2026-08-01'
AND `status` = 'completed'